<?php

/*
|--------------------------------------------------------------------------
| BM 模块配置
|--------------------------------------------------------------------------
|
| BM: Backend Master
| package name:  geekor/backend-master
|
*/

return [
    /*
    |--------------------------------------------------------------------------
    | BM 路由前缀
    |--------------------------------------------------------------------------
    |
    | 就是 API 附加的前缀，如 /api/xxx/...
    | 这里的 xxx 就是 prefix，默认为： backend
    |
    | 注意： /api 开头是固定的，也是必须的（已经在 router 配置中写死，这里不用加了）
    |       否则无法在异常处理（app/Exceptions/Handler.php）中捕捉 api 的报错！
    |
    */
    'prefix' => 'backend',

    /*
    |--------------------------------------------------------------------------
    | BM 路由控制
    |--------------------------------------------------------------------------
    |
    | 是否使用 BackendMaster 中定义的路由。默认： true
    |
    | 可以使用 php artisan route:list 命令查看有哪些接口！
    |
    */
    'routes' => [
        // 后台用户
        'backend' => true,
        // 普通用户
        'normal' => true,
        // 可以共用的 token 管理
        'token' => true,
    ],

    /*
    |--------------------------------------------------------------------------
    | 启用 APP 访问权限检查
    |--------------------------------------------------------------------------
    */
    'use_app_access_check' => true,

    /*
     * APP 登录权限控制
     * -------------------
     * App-Mark => 权限名
     * -------------------
     * w-*   web app
     * a-*   android app
     * i-*   ios app
     */
    'app_access_permission' => [
        'w-sti' => 'master:wapp-master-login',

        'a-pets' => null, // null 表示不限制
        'i-pets' => null,
    ],

    /*
    |--------------------------------------------------------------------------
    | 启用检查 API 请求头
    |--------------------------------------------------------------------------
    */
    'use_api_headers_check' => false,
];
